Диплом/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>AccumulationRegister.ВКМ_ОтпускаСотрудников</registerRecords>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>График</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цвет</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Диплом/src/AccumulationRegisters/ВКМ_ОтпускаСотрудников/ВКМ_ОтпускаСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ОтпускаСотрудников</name>
  <resources>
    <name>ДнейОтпуска</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Диплом/src/Documents/ВКМ_ГрафикОтпусков/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Движения.ВКМ_ОтпускаСотрудников.Записывать = Истина;
	Для Каждого ТекСтрокаГрафик из График Цикл
		Если ТекСтрокаГрафик.ДатаНачала < НачалоГода(Год) 
			или ТекСтрокаГрафик.ДатаОкончания > КонецГода(Год) тогда
			Отказ = Истина;
			ТексСообщения = СтрШаблон("Дата отпуска сотрудника %1 не соответсвует году графика", ТекСтрокаГрафик.Сотрудник);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТексСообщения);
		КонецЕсли;	
		
		Движение = Движения.ВКМ_ОтпускаСотрудников.Добавить();
		Движение.Период = НачалоГода(Год);
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Сотрудник = ТекСтрокаГрафик.Сотрудник;
		Движение.ДнейОтпуска = (КонецДня(ТекСтрокаГрафик.ДатаОкончания) - ТекСтрокаГрафик.ДатаНачала+1)/(3600*24);
	КонецЦикла;
	
КонецПроцедуры	

#КонецОбласти
